Revit 2024 API
CylindricalSurface.XDir Property
 X axis of the local coordinate system associated with this cylinder.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public XYZ XDir { get; }
Visual Basic
Public ReadOnly Property XDir As XYZ
	Get
Visual C++
public:
property XYZ^ XDir {
	XYZ^ get ();
}
See Also
CylindricalSurface Class
Autodesk.Revit.DB Namespace